import React from 'react';
import { Link } from 'react-router-dom';

function About() {
  return (
    <div className="container mt-5 biography-container">
      <h2 className="mb-4 text-center">🌟 Матвей Петрович Егоров</h2>
        <div className="text-center mb-4">
            <img 
            src={`${process.env.PUBLIC_URL}/images/Matvey.png`}
            alt="Матвей Петрович Егоров"
            className="img-fluid rounded shadow-sm biography-photo"
            style={{ maxWidth: '300px' }}
            />
            <p className="mt-2 text-muted">Фото: Матвей Петрович Егоров</p>
        </div>
      <p className="mb-4" lang="sah">
        Мин бииргэ торобут убайым, Түбэй Дьаархан олохтооно, уруккута «Правда» холкуос чилиэнэ Егоров Матвей Петрович - сэрии, улэ бэгэрээнэ этэ.
        Сэриигэ барыан иннинэ суоччугунан, бэрэссэдээтэлинэн улэлии сылдьыбыта. 1908 сыллаахха төрөөбүтэ. Сиэйэҕэ пансионна үөрэнэ сырыттаҕына,
        кыанар ыал овото эбит диэннэр ууратан кэбиспиттэр. Матвей кэлин ликбезкэ учууталлаан, улахан дьону ааҕарга, суруйарга,
        ахсаан суоттуурга үөрэтэрин кыра сылдьан көрөрүм.
      </p>
      <p lang="sah">
        1942 сыллаахха от ыйыгар сэриигэ ынырыллан барбыта. 1943 сыллаахха К.К. Рокоссовскай командующайдаах 2-с Белорусскай фронт
        1262-с стрелковай полкатыгар пулеметчигынан сылдьыбыта. 1944 сыл от ыйыттан маршал Г.К.Жуков командующайдаах. Ленинградтааҕы фронна
        сылдыһан, элбэх дэриэбинэлэри босхолоһон, сэриини Рижскай хомоно түмүктээбитэ. Иккитэ ыараханнык бааһыран, Москва, Ленинград, Смоленскай,
        Псков куораттар госпиталларыгар эмтэммитэ. 1945 сыллаахха дойдутугар эргиллэн кэлбитэ.
      </p>
      <p lang="sah">
        Матвей Петрович сэрииттэн кэлэн баран сельсовет бэрэссэдээтэлинэн, маҕаһыынна атыылааччынан үлэлээбитэ. Оҕолорун үөрэттэрээри,
        Ньурбаҕа көспүтэ. Бастаан утаа комбинакка столярынан, Куочай, Араҥастаах оҕо дьиэтигэр оҕолору уһанар идэҕэ үөрэтэлээбитэ.
        Бэйэтин оҕолоро үөрэхтэрин бүтэрбиттэрин кэннэ дойдутугар кэлэн, сана дьиэ туттубута. Син добуочча өр олорон баран,
        олохтон туораабыта. Кэннигэр 7 оҕону, 21 сиэни, 51 хос сизни хаалларбыта Матвей Петрович суруйар, туойар, үнкүү тылын этэр,
        атах оонньууларыгар оонньуур буолара. Кэргэнэ Василисса Михайловна билигин да этэҥҥэ олорор. Саҥаһым өссө да уһуннук олордун,
        үйэлэргэн үйэлэргэ ааттара ааттана турдуннар.
      </p>
      <p className="text-end fst-italic">Автор биографии: Вера Егорова-Чарду</p>
      <p className="text-end fst-italic">Место: Кутана сэл</p>

      <div className="text-center mt-4">
        <Link to="/quiz" className="btn btn-success">🧠 К викторине</Link>
      </div>
    </div>
  );
}

export default About;
