import React from 'react';
import { Link } from 'react-router-dom';

function Book() {
  return (
    <div className="container mt-5 biography-container">
      <h2 className="mb-4 text-center">📘 «Ийэ тыл кэрэһитэ»</h2>
      <div className='text-center mb-4'>
        <img src={`${process.env.PUBLIC_URL}/images/book.jpg`} alt="Обложка книги" className="img-fluid rounded my-4 biography-photo" style={{ maxWidth: '400px' }}/>
      </div>
      <p>
        <strong>«Ийэ тыл кэрэһитэ»</strong> — 
        Кинигэ 2019 сыллаахха бэчээттэммит таһаарыы иккис чааһынан буолар. 
        Манна Сунтаар оройуонун Түбэй Дьаарханыгар олорон ааспыт норуот ырыаһыта, 
        олонхоһут, сэһэнньит, Аҕа дойду Улуу сэриитин кыттыы- лааҕа, үлэ бэтэрээнэ 
        Матвей Петрович Егоров-Мындыырап Маппыай олоҕун кэрчиктэрэ, айымнылара, 
        ити- ни тэнэ кини чугас аймаҕа, үөлээннээҕэ, Аар тайҕа ырыаһыта, дэгиттэр дьоҕурдаах 
        С.А. Зверев-Кыыл Уолун туһунан хомуйбут баай матырыйаала, олоҕун аргыһа В.М. Егорова 
        уонна кини бииргэ төрөөбүттэрин туһунан ахтыылар, суруйар-бичийэр дьоҕурдаах аймах-билэ 
        дьон айымнылара киирдилэр. Ааҕааччы киэн аранатыгар ананар
      </p>
      <h4 className='text-center'>Бырайыак салайааччычылара</h4>
      <p className='text-indent: 20px;'>
        «Сунтаар - Олонхо дойдуга» көмүс серия 2017 сылга төрүттэммитэ.
        Бырайыак салайааччылара:
        У.Д. Попова, А.В. Григорьев, Сунтаар улууһун баһылыга
        Сунтаар улууһун депутаттарын сэбиэтин председателэ
        С.Д. Омукова, Сунтаар улууһун култууратын уонна айылгытын салалтатын салайааччыта
        Серия «Сунтаар улууһа (оройуона)» Муниципальнай оройуон үбүлээһининэн тахсар
        Хомуйан онордулар: В.М.Егорова, Б.М. Егоров
        Эппиэттиир эрэдээктэр: О.В.Захарова
      </p>     
      <div className="text-center mt-4">
        <Link to="/" className="btn btn-outline-primary me-2">⬅ На главную</Link>
        <Link to="/quiz" className="btn btn-success">🧠 Перейти к викторине</Link>
      </div>
    </div>
  );
}

export default Book;
